## Terraform Plan

⚠️ **Changes detected** — `Plan: 2 to add, 1 to change, 2 to destroy.`

<details>
<summary>Show plan</summary>

```hcl
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jnsartwell/valheim/runs/run-RafLCrpdKVhRqi1B

Waiting for the plan to start...

Terraform v1.14.7
on linux_amd64
Initializing plugins and modules...
module.redmist.hcloud_ssh_key.default: Refreshing state... [id=109144931]
module.redmist.hcloud_volume.world: Refreshing state... [id=105137794]
module.redmist.hcloud_firewall.valheim: Refreshing state... [id=10702666]
module.redmist.hcloud_server.valheim: Refreshing state... [id=123887671]
module.redmist.hcloud_volume_attachment.world: Refreshing state... [id=105137794]
module.redmist.cloudflare_record.valheim: Refreshing state... [id=5c94b938686d45a811c14c75b306a320]
module.redmist.hcloud_volume.world: Drift detected (update)
module.redmist.hcloud_firewall.valheim: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.redmist.cloudflare_record.valheim will be updated in-place
  ~ resource "cloudflare_record" "valheim" {
      ~ content         = "178.156.133.180" -> (known after apply)
        id              = "5c94b938686d45a811c14c75b306a320"
        name            = "valheim"
        tags            = []
        # (11 unchanged attributes hidden)
    }

  # module.redmist.hcloud_server.valheim must be replaced
-/+ resource "hcloud_server" "valheim" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "ash-dc1" -> (known after apply)
      ~ id                         = "123887671" -> (known after apply)
      ~ ipv4_address               = "178.156.133.180" -> (known after apply)
      ~ ipv6_address               = "2a01:4ff:f0:961::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4ff:f0:961::/64" -> (known after apply)
        name                       = "valheim"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 160 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = (sensitive value) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.redmist.hcloud_volume_attachment.world must be replaced
-/+ resource "hcloud_volume_attachment" "world" {
      ~ id        = "105137794" -> (known after apply)
      ~ server_id = 123887671 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ server_ip     = "178.156.133.180" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Triggered by jnsartwell @ `8f753f6`